#include <stdio.h>
#define NO 10
main() {
	char n, i;
	char grade[6][5]={"사원","대리","과장","차장","부장","이사"};
	int salary[NO][5], sub[6][4]={{1500,200,1400,5},{2100,300,2000,7},{2500,500,2300,10},
								{3200,600,3100,15},{3700,700,3300,20},{4500,900,4300,25}};
								
	char name[NO][9]={"김선달","남궁갑돌","변사또","서경덕","성춘향","이도령","이돌","황진이","향단이","홍길동"};
	int code[NO]={0,0,2,1,0,5,1,2,3,4};
	
	for(n=0; n<NO; n++) {
		for(i=0; i<=3; i++) 
		salary[n][i]=sub[code[n]][i]; 
		salary[n][4]=sub[code[n]][0]+sub[code[n]][1]+sub[code[n]][2];
	} 
	
	printf("--------------------------------\n");
	printf("\t 9월 봉급 명세서(단위:천원)\n");
	printf("번호 이름  직급 기본급 성과급 상여금 합계 세율 수령액\n");
	printf("--------------------------------\n");
	for(n=0; n<NO; n++) {
		if(n!=0&& n%5==0) printf("\n---------------------------------------------\n");
		printf("%d", n+1);
		printf("") 
	
	
	}
	
					 
}
